const Map<String, String> arSA = {
  // ============================================================
  // 🏠 Onboarding Screen
  // ============================================================
  'onboarding_title': 'مرحبًا بك في بارا جوب!',
  'onboarding_subtitle': 'ابحث عن فرص عملك القادمة بسهولة وسرعة.',
  'onboarding_next': 'التالي',
  'onboarding_skip': 'تخطي',
  'onboarding_get_started': 'ابدأ الآن',

  // ============================================================
  // 🔐 Login Screen
  // ============================================================
  'login_title': 'مرحبًا بعودتك',
  'login_email_hint': 'أدخل بريدك الإلكتروني',
  'login_password_hint': 'أدخل كلمة المرور',
  'login_button': 'تسجيل الدخول',
  'login_forgot_password': 'هل نسيت كلمة المرور؟',
  'login_no_account': 'ليس لديك حساب؟',
  'login_sign_up': 'سجل الآن',

  // ============================================================
  // 🔑 Forgot Password Screen
  // ============================================================
  'forgot_password_title': 'نسيت كلمة المرور',
  'forgot_password_subtitle':
      'يرجى إدخال رقم هاتفك لاستلام\n رمز التحقق الخاص بك',
  'forgot_password_phone_hint': 'أدخل رقم هاتفك',
  'forgot_password_send_button': 'إرسال',

  // ============================================================
  // 🔢 Forgot Password OTP Screen
  // ============================================================
  'forgot_password_otp_title': 'تحقق من رقمك',
  'forgot_password_otp_subtitle': 'تحقق من رسائلك للعثور على رمز التحقق',
  'forgot_password_otp_verify_button': 'تحقق',
  'forgot_password_otp_resend_button': 'إرسال مرة أخرى',

  // ============================================================
  // 🔐 Set New Password Screen
  // ============================================================
  'set_new_password_title': 'تعيين كلمة المرور',
  'set_new_password_hint': 'أدخل كلمة المرور الجديدة',
  'set_new_password_confirm_hint': 'أكد كلمة المرور الجديدة',
  'set_new_password_confirm_button': 'تأكيد',

  // ============================================================
  // 📝 Create Account Screen
  // ============================================================
  'create_account_title': 'إنشاء حساب جديد',
  'create_account_main_info': 'المعلومات الرئيسية',
  'create_account_name_hint': 'أدخل اسمك الكامل',
  'create_account_dob_hint': 'أدخل تاريخ ميلادك',
  'create_account_phone_hint': 'أدخل رقم هاتفك',
  'create_account_email_hint': 'أدخل بريدك الإلكتروني',
  'create_account_id_hint': 'أدخل رقم بطاقتك',
  'create_account_gender_hint': 'اختر جنسك',
  'create_account_location_info': 'معلومات الموقع',
  'create_account_loading_cities': 'تحميل المدن...',
  'create_account_city_hint': 'اختر مدينتك',
  'create_account_failed_load_retry': 'فشل التحميل، انقر لإعادة المحاولة',
  'create_account_loading_areas': 'تحميل المناطق...',
  'create_account_failed_load_areas': 'فشل تحميل المناطق، انقر لإعادة المحاولة',
  'create_account_select_city_first': 'اختر مدينة أولاً',
  'create_account_continue_button': 'متابعة',
  'create_account_contact_us': 'اتصل بنا',

  // ============================================================
  // 🔢 Create Account OTP Screen
  // ============================================================
  'create_account_otp_title': 'تحقق من رقمك',
  'create_account_otp_subtitle': 'تحقق من رسائلك للعثور على رمز التحقق',
  'create_account_otp_verify_button': 'تحقق',
  'create_account_otp_resend_button': 'إرسال مرة أخرى',
  'create_account_otp_contact_us': 'اتصل بنا',

  // ============================================================
  // 🔑 Create Account Set Password Screen
  // ============================================================
  'create_account_set_pass_title': 'تعيين كلمة مرور جديدة',
  'create_account_set_pass_password_hint': 'أدخل كلمة المرور',
  'create_account_set_pass_confirm_hint': 'أعد إدخال كلمة المرور',
  'create_account_set_pass_continue_button': 'متابعة',
  'create_account_set_pass_contact_us': 'اتصل بنا',

  // ============================================================
  // 🆔 Back National ID Screen
  // ============================================================
  'back_national_id_title': 'مسح البطاقة الوطنية',
  'back_national_id_subtitle': 'حان وقت التحقق من هويتك',
  'back_national_id_scan_text_1': 'اضغط لتحميل',
  'back_national_id_scan_text_back': ' الجهة الخلفية',
  'back_national_id_scan_text_2': ' للبطاقة',
  'back_national_id_note_1': 'تأكد من أن المحيط مضاء بشكل جيد.',
  'back_national_id_note_2':
      'تأكد من أن الصورة داخل الإطار وأن \nالتفاصيل سهلة القراءة',
  'back_national_id_confirm_button': 'تأكيد',

  // ============================================================
  // 🆔 Front National ID Screen
  // ============================================================
  'front_national_id_title': 'مسح البطاقة الوطنية',
  'front_national_id_subtitle': 'حان وقت التحقق من هويتك',
  'front_national_id_scan_text_1': 'اضغط لتحميل',
  'front_national_id_scan_text_front': ' الجهة الأمامية',
  'front_national_id_scan_text_2': ' للبطاقة',
  'front_national_id_note_1': 'تأكد من أن المحيط مضاء بشكل جيد.',
  'front_national_id_note_2':
      'تأكد من أن الصورة داخل الإطار وأن \nالتفاصيل سهلة القراءة',
  'front_national_id_confirm_button': 'تأكيد',

  // ============================================================
  // 📸  Picture With ID Screen
  // ============================================================
  'picture_with_id_title': 'مسح البطاقة الوطنية',
  'picture_with_id_subtitle': 'حان وقت التحقق من هويتك',
  'picture_with_id_instruction': 'التقط صورة لنفسك وأنت تحمل البطاقة.',
  'picture_with_id_note_1': 'تأكد من أنك تنظر إلى الكاميرا\nمواجهاً للضوء.',
  'picture_with_id_note_2': 'تأكد من أن التفاصيل سهلة القراءة.',
  'picture_with_id_confirm_button': 'تأكيد',

  // ============================================================
  // 🎓 Education Info Screen
  // ============================================================
  'education_info_title': 'التعليم',
  'education_info_loading_universities': 'تحميل الجامعات...',
  'education_info_university_hint': 'اختر جامعتك',
  'education_info_failed_load_universities':
      'فشل تحميل الجامعات، انقر لإعادة المحاولة',
  'education_info_loading_faculties': 'تحميل الكليات...',
  'education_info_faculty_hint': 'اختر كليتك',
  'education_info_failed_load_faculties':
      'فشل تحميل الكليات، انقر لإعادة المحاولة',
  'education_info_select_university_first': 'اختر جامعة أولاً',
  'education_info_graduation_year_hint': 'اختر سنة التخرج',
  'education_info_status_hint': 'الحالة',
  'education_info_continue_button': 'متابعة',
  'education_info_contact_us': 'اتصل بنا',

  // ============================================================
  // 📷  Education Picture Screen
  // ============================================================
  'education_pic_title': 'التعليم',
  'education_pic_subtitle': 'حان وقت التحقق من جامعتك',
  'education_pic_note': 'ملاحظة :\nاضغط لاختيار مستند  يثبت \nأنك طالب جامعي.',
  'education_pic_note_1': 'تأكد من أن المحيط مضاء بشكل جيد.',
  'education_pic_note_2':
      'تأكد من أن الصورة داخل الإطار وأن \nالتفاصيل سهلة القراءة',
  'education_pic_confirm_button': 'تأكيد',

  // ============================================================
  // 💪 Create Account Skills Screen
  // ============================================================
  'create_account_skills_title': 'إضافة مهارات',
  'create_account_skills_loading': 'تحميل المهارات...',
  'create_account_skills_hint': 'اختر مهارة',
  'create_account_skills_failed_load': 'فشل التحميل، انقر لإعادة المحاولة',
  'create_account_skills_continue_button': 'متابعة',
  'create_account_skills_contact_us': 'اتصل بنا',

  // ============================================================
  // 📄  Create Account CV Screen
  // ============================================================
  'create_account_cv_title': 'رفع السيرة الذاتية',
  'create_account_cv_subtitle': 'حان وقت رفع سيرتك الذاتية.',
  'create_account_cv_confirm_button': 'تأكيد',

  // ============================================================
  // 🏡 Home Screen
  // ============================================================
  'home_greeting': 'مرحبًا',
  'home_welcome_back': 'مرحبًا بعودتك!',
  'home_find_jobs': 'ابحث عن وظائف',
  'home_notifications': 'الإشعارات',

  // ============================================================
  // ⚙️ Settings Screen
  // ============================================================
  'settings_title': 'الإعدادات',
  'settings_language': 'اللغة',
  'settings_logout': 'تسجيل الخروج',
  'settings_dark_mode': 'الوضع الليلي',

  // ============================================================
  // 🏡 Home Screen
  // ============================================================
  'welcome': 'أهلاً، @name',
  'guest': 'ضيف',
  'discover_jobs': 'اكتشف الوظائف',
  'search_hint': 'ابحث عن وظائف، شركات...',
  'hot_jobs': 'وظائف شائعة',
  'flexible_jobs': 'وظائف مرنة',
  'non_flexible_jobs': 'وظائف غير مرنة',
  'search_job_hint': 'ابحث عن الوظائف حسب المسمى الوظيفي',
  'filter': 'تصفية',
  'job_type': 'نوع الوظيفة',
  'skills': 'المهارات',
  'company': 'الشركة',
  'categories': 'الفئات',
  'apply_filter': 'تطبيق التصفية',
  'see_all': 'عرض الكل',
  'apply_now': 'قدّم الآن',
  'egp': 'جنيه',
  'per_month': '/شهري',

  // ============================================================
  // 🏡 job details Screen
  // ============================================================
  'description': 'الوصف',
  'requirements': 'المتطلبات',
  'required_skills': 'المهارات المطلوبة',
  'delete_my_application': 'حذف طلب التقديم',
  'apply_for_job': 'التقدم لهذه الوظيفة',
  'delete_application_confirmation':
      'هل أنت متأكد أنك تريد حذف طلبك لهذه الوظيفة؟',
  'delete_application_warning':
      'تحذير: إذا حاولت حذف طلبك قبل 48 ساعة من الموعد، ستدفع رسومًا على وظيفتك التالية.',

  // ============================================================
  // 🏡 apply job Screen
  // ============================================================
  'review_application': 'مراجعة الطلب',
  'full_name': 'الاسم الكامل',
  'phone': 'الهاتف',
  'email': 'البريد الإلكتروني',
  'status': 'الحالة التعليمية',
  'national_id': 'الرقم القومي',
  'document': 'المستند',
  'uploaded': 'تم الرفع',
  'apply_job_button': 'نعم، قدّم لهذه الوظيفة',

  // ============================================================
  // complaint Screen
  // ============================================================
  'submit_complaint': 'تقديم شكوى',
  'about': 'عن ',
  'complaint_hint': 'شارك مشاكلك معنا..',
  'submit_complaint_button': 'إرسال الشكوى',
  'company_already_complaint': 'لقد قدمت شكوى بالفعل لهذه الشركة.',
  'job_already_complaint': 'لقد قدمت شكوى بالفعل لهذه الوظيفة.',
  'complaint_about': 'شكوى عن ',
  'complaint_about_job': 'شكوى حول الوظيفة',

  // ============================================================
  // employee Review Screen
  // ============================================================
  'reviews': 'التقييمات',
  'no_reviews_found': 'لا توجد تقييمات',

  // ============================================================
  // active Jobs Screen
  // ============================================================
  'active_jobs': 'الوظائف النشطة',

  // ============================================================
  // employee  Screen
  // ============================================================
  'no_data': 'لا توجد بيانات',
  'jobs': 'الوظائف',
  'employees': 'الموظفون',
  'positive_reviews': 'التقييمات الإيجابية',
  'already_shared_feedback':
      'لقد قمت بمشاركة رأيك حول هذا صاحب العمل. شكرًا على ملاحظاتك!',
  'view_all': 'عرض الكل',
  'no_active_jobs': 'لا توجد وظائف نشطة في الوقت الحالي.',
  'write_review': 'اكتب مراجعة',
  'share_opinion': 'شارك رأيك معنا..',
  'anonymous_member': 'عضو مجهول',
  'submit': 'إرسال',
  'no_recent_reviews': 'لا توجد مراجعات حديثة متاحة.',

  // ============================================================
  // 👤 Profile Screen
  // ============================================================
  'profile_no_job_history': 'لم يتم العثور على سجل وظائف',
  'profile_job_history_title': 'سجل ووظائفك',
  'profile_no_saved_jobs': 'لم يتم العثور على وظائف محفوظة',
  'profile_saved_jobs_title': 'الوظائف المحفوظة',

  // ============================================================
  // 👤 Profile Info Widget
  // ============================================================
  'profile_info_jobs': 'الوظائف',
  'profile_info_income': 'الدخل',
  'profile_info_companies': 'الشركات',
  "take_photo": "التقط صوره",
  "choose_photo": "اختر صوره",
  "remove_photo": "حذف الصوره",

  // ============================================================
  // ⚡ More Screen (Settings)
  // ============================================================
  'more_settings_title': 'الإعدادات',
  'more_language': 'اللغة',
  'more_account_title': 'الحساب',
  'more_edit_personal_info': 'تعديل البيانات الشخصية',
  'more_change_password': 'تغيير كلمة المرور',
  'more_delete_account': 'حذف الحساب',
  'more_delete_account_confirmation': 'هل أنت متأكد من رغبتك في حذف حسابك؟',
  'more_delete_account_warning':
      'تحذير: إذا حذفت حسابك، سوف تفقد جميع بياناتك وترتيبك.',
  'more_delete_account_button': 'حذف حسابي',
  'more_logout': 'تسجيل الخروج',
  'more_logout_confirmation': 'هل أنت متأكد من رغبتك في تسجيل الخروج من حسابك؟',
  'more_logout_button': 'تسجيل الخروج',
  'more_help_title': 'المساعدة',
  'more_about_us': 'عنا',
  'more_contact_us': 'اتصل بنا',

  // ============================================================
  // ℹ️ About Us Screen
  // ============================================================
  'about_us_about_app': 'حول التطبيق',
  'about_us_rate_app': 'قيّمنا على متجر التطبيقات',
  'about_us_instagram': 'تابعنا على إنستغرام',
  'about_us_twitter': 'تابعنا على تويتر',
  'about_us_facebook': 'أعجبنا على فيسبوك',

  // ============================================================
  // 📚 About App Screen
  // ============================================================
  'about_app_title': 'حول بارا جوب',
  'about_app_vision_default': 'رؤيتنا',
  'about_app_mission_default': 'رسالتنا',
  'about_app_values_default': 'قيمنا',

  // ============================================================
  // 📧 Contact Us Screen
  // ============================================================
  'contact_us_title': 'الشكوى أو الاقتراح',
  'contact_us_message_hint': 'شارك مشاكلك معنا..',
  'contact_us_heading': 'تواصل معنا',
  'contact_us_email_title': 'ابعث لنا بالبريد الإلكتروني',
  'contact_us_phone_title': 'عبر الهاتف',
  'contact_us_submit_button': 'إرسال الشكوى',

  // ============================================================
  // ✏️ Edit Main Info Screen
  // ============================================================
  'edit_main_info_loading_cities': 'تحميل المدن...',
  'edit_main_info_city_hint': 'اختر مدينتك',
  'edit_main_info_failed_load_cities': 'فشل التحميل، انقر لإعادة المحاولة',
  'edit_main_info_loading_areas': 'تحميل المناطق...',
  'edit_main_info_failed_load_areas': 'فشل تحميل المناطق، انقر لإعادة المحاولة',
  'edit_main_info_select_city_first': 'اختر مدينة أولاً',
  'edit_main_info_save_button': 'حفظ التغييرات',

  // ============================================================
  // 🎓 Edit Education Screen
  // ============================================================
  'edit_education_loading_faculties': 'تحميل الكليات...',
  'edit_education_faculty_hint': 'اختر كليتك',
  'edit_education_failed_load': 'فشل التحميل، انقر لإعادة المحاولة',
  'edit_education_save_button': 'حفظ التغييرات',

  // ============================================================
  // 📄 Edit CV Screen
  // ============================================================
  'edit_cv_save_button': 'حفظ التغييرات',

  // ============================================================
  // 🆔 Edit National ID Screen
  // ============================================================
  'edit_national_id_save_button': 'حفظ التغييرات',

  // ============================================================
  // ✏️ Edit Profile Screen
  // ============================================================
  'edit_profile_title': 'تعديل البيانات الشخصية',
  'edit_profile_tab_main_info': 'المعلومات الأساسية',
  'edit_profile_tab_education': 'البيانات التعليمية',
  'edit_profile_tab_cv': 'السيرة الذاتية',
  'edit_profile_tab_national_id': 'بطاقة الهوية',
  'edit_profile_tab_skills': 'المهارات',

  // ============================================================
  // 🎯 Edit Skills Screen
  // ============================================================
  'edit_skills_loading': 'تحميل المهارات...',
  'edit_skills_hint': 'اختر مهارة',
  'edit_skills_failed_load': 'فشل التحميل، انقر لإعادة المحاولة',
  'edit_skills_save_button': 'حفظ التغييرات',

  // ============================================================
  // 🔍 Change Password OTP Screen
  // ============================================================
  'change_pass_otp_title': 'تحقق من رقمك',
  'change_pass_otp_subtitle': 'التمس مراسلاتك لبحث OTP',
  'change_pass_otp_verify_button': 'التحقق',
  'change_pass_otp_resend_button': 'إرسال مرة أخرى',

  // ============================================================
  // 🔐 Change Password Screen
  // ============================================================
  'change_password_title': 'عين كلمة المرور',
  'change_password_new_hint': 'أدخل كلمة المرور الجديدة',
  'change_password_confirm_hint': 'أعد إدخال كلمة المرور الجديدة',
  'change_password_confirm_button': 'تأكيد',

  // ============================================================
  // 🔔 My Notifications Screen
  // ============================================================
  'notifications_no_found': 'لم يتم العثور على الإخطارات',

  // ==========================================================
  // 💼 My Jobs Screen
  // ============================================================
  'my_jobs_tab_applied': 'الوظائف المتقدم فيها',
  'my_jobs_tab_approved': 'الوظائف المعتمدة',
  'my_jobs_applied_description':
      'الوظائف التي تقدمت فيها وتنتظر الموافقة والتعيين عليها.',
  'my_jobs_approved_description':
      'هذه الفئة تشمل جميع وظائفك المعتمدة، هنا توقع عقودك واعرض وظائفك.',

  // ============================================================
  // ✅ Application Verification OTP Screen
  // ============================================================
  'app_verify_otp_title': 'تحقق من طلب الوظيفة',
  'app_verify_otp_subtitle': 'التمس رسالتك لبحث OTP الوظيفة.',
  'app_verify_otp_verify_button': 'التحقق',
  'app_verify_otp_resend_button': 'إرسال مرة أخرى',

  // ============================================================
  // 📄 Contract Screen
  // ============================================================
  'contract_no_found': 'لم يتم العثور على عقد.',
  'contract_agree_terms': 'نعم، أوافق على جميع الشروط والأحكام.',
  'contract_sign_instruction': 'الرجاء التوقيع بعلامتك أدناه:',
  'contract_clear_button': 'حذف',
  'contract_finish_button': 'انتهاء',

  // ============================================================
  // 📋 My Jobs Widgets
  // ============================================================
  'my_job_no_jobs_found': 'لم يتم العثور على وظائف',
  'my_job_contract_pending': 'عقد معلّق',
  'my_job_contract_signed': 'تم توقيع العقد',
  'my_job_dialog_congrats': 'تهانينا! تم قبول طلبك لهذه الوظيفة. 🎉',
  'my_job_dialog_sign_contract': 'وقّع على العقد',

  // ============================================================
  // 🏷️ Job Application Status
  // ============================================================
  'job_status_pending': 'قيد الانتظار',
  'job_status_shortlisted': 'مدرج في القائمة المختصرة',
  'job_status_accepted': 'مقبول',
  'job_status_rejected': 'مرفوض',
  'job_status_interview_scheduled': 'تم جدولة المقابلة',

  // ============================================================
  // 🏷️ Job Types
  // ============================================================
  'job_type_full_time': 'دوام كامل',
  'job_type_part_time': 'دوام جزئي',

  // ============================================================
  // 📋language
  // ============================================================
  'language': 'اللغه',

  // ============================================================
  // 🧭 Main Navigator
  // ============================================================
  'nav_home': 'الرئيسية',
  'nav_jobs': 'الوظائف',
  'nav_notifications': 'الإشعارات',
  'nav_profile': 'الملف الشخصي',

  // ============================================================
  // 🔔 Notifications Section Labels
  // ============================================================
  'notification_today': 'اليوم',
  'notification_yesterday': 'أمس',
  'notification_earlier': 'الإشعارات السابقة',

  // ============================================================
  // 📚 Job History List
  // ============================================================
  'job_history_view_more': 'عرض المزيد',

  // ============================================================
  // 📃 Saved Jobs Screen
  // ============================================================
  'saved_jobs_title': 'الوظائف المحفوظة',

  // ============================================================
  // ✅ Validation Messages
  // ============================================================
  'validation_email_empty': 'البريد الإلكتروني لا يمكن أن يكون فارغًا',
  'validation_email_invalid': 'تنسيق البريد الإلكتروني غير صالح',
  'validation_otp_empty': 'رمز التحقق لا يمكن أن يكون فارغًا',
  'validation_otp_length': 'رمز التحقق يجب أن يكون 5 أرقام بالضبط',
  'validation_national_id_empty': 'الرقم القومي لا يمكن أن يكون فارغًا',
  'validation_national_id_length': 'الرقم القومي يجب أن يكون 14 رقمًا بالضبط',
  'validation_national_id_digits': 'الرقم القومي يجب أن يحتوي على أرقام فقط',
  'validation_national_id_century': 'القرن غير صالح في الرقم القومي',
  'validation_national_id_month': 'شهر الميلاد غير صالح في الرقم القومي',
  'validation_national_id_day': 'يوم الميلاد غير صالح في الرقم القومي',
  'validation_phone_empty': 'رقم الهاتف لا يمكن أن يكون فارغًا',
  'validation_phone_format':
      'رقم الهاتف يجب أن يكون 11 رقمًا (مثل 01*********)',
  'validation_name_empty': 'الاسم لا يمكن أن يكون فارغًا',
  'validation_name_format':
      'تنسيق الاسم غير صالح. الحروف والمسافات فقط مسموحة.',
  'validation_message_empty': 'الرسالة لا يمكن أن تكون فارغة',
  'validation_message_min_length': 'الرسالة يجب أن تكون 10 أحرف على الأقل',
  'validation_message_max_length': 'الرسالة طويلة جدًا. الحد الأقصى 100 حرف',
  'validation_password_empty': 'كلمة المرور لا يمكن أن تكون فارغة',
  'validation_password_min_length': 'كلمة المرور يجب أن تكون 6 أحرف على الأقل',
  'validation_confirm_password_empty':
      'تأكيد كلمة المرور لا يمكن أن يكون فارغًا',
  'validation_confirm_password_mismatch': 'كلمات المرور غير متطابقة',

  // ============================================================
  // 🔐 Auth Required Dialog
  // ============================================================
  'auth_required_title': 'انضم إلى ParaJob الآن لبدء الكسب!',
  'auth_required_button': 'إنشاء حساب',

  // ============================================================
  // ⚠️ Error Screen
  // ============================================================
  'error_screen_default_message':
      'فشل تحميل البيانات.\nيرجى التحقق من اتصالك بالإنترنت.',
  'error_screen_retry_button': 'إعادة المحاولة',

  // ============================================================
  // 📢 Snackbar Messages
  // ============================================================
  'snackbar_something_went_wrong': 'حدث خطأ ما',
  'snackbar_check_connection': 'يرجى التحقق من اتصالك وإعادة المحاولة.',
  'snackbar_job_application_congrats':
      'تهانينا! طلبك لهذه الوظيفة قيد المراجعة الآن. 🎉',
  'snackbar_complaint_success':
      '"تم إرسال شكواك، يرجى انتظار تواصل فريقنا معك .',

  // ============================================================
  // 📍 Location Messages
  // ============================================================
  'location_not_available': 'الموقع غير متوفر',
  'location_invalid_link': 'رابط غير صالح',
  'location_failed_to_open': 'تعذر فتح الموقع',
  'location_link_not_available': 'رابط الموقع غير متوفر',
  'location_error': 'خطأ',

  // ============================================================
  // 📤 Share Job Messages
  // ============================================================
  'share_error': 'خطأ في المشاركة',
  'failed_to_share_job': 'فشل في مشاركة الوظيفة',

  // ============================================================
  // 🔐 Auth Choice Screen
  // ============================================================
  'auth_choice_title': 'تسجيل الدخول أو إنشاء حساب',
  'auth_choice_continue_with_email': 'متابعة باستخدام البريد الإلكتروني',
  'auth_choice_agree_to': 'بالمتابعة، فإنك توافق على\t',
  'auth_choice_privacy_policy': 'سياسة الخصوصية',
  'auth_choice_or': 'أو',
  'auth_choice_continue_as_guest': 'متابعة كمستخدم ضيف',
  'auth_choice_need_help': 'تحتاج مساعدة؟',
  'auth_choice_continue_with_google': 'متابعة باستخدام جوجل',
  // ============================================================
  // 📄 PDF Viewer Screen
  // ============================================================
  'pdf_viewer_title': 'عارض PDF',

  // ============================================================
  // Email login controller
  // ============================================================
  "incomplete_profile": "الملف الشخصي غير مكتمل",
  "please_complete_registration": "يرجى استكمال التسجيل.",
  "not_verified_title": "غير مُفعَّل",
  "not_verified_message": "يرجى إكمال عملية التسجيل للمتابعة.",
  "pending_approval_title": "في انتظار الموافقة",
  "pending_approval_message":
      "حسابك قيد المراجعة من قبل الإدارة. يرجى الانتظار.",
  "success_title": "نجاح",
  "failed_title": "فشل",
  "unknown_error": "حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى.",
  'google_login_canceled_title': 'تم إلغاء تسجيل الدخول',
  'google_login_canceled_message': 'لقد قمت بإلغاء عملية تسجيل الدخول.',
  'google_login_config_error_title': 'خطأ في الإعدادات',
  'google_login_config_error_message':
      '  يرجى مراجعة إعدادات خدمه تسجيل الدخول عبر جوجل',
  'google_login_unknown_error_title': 'خطأ غير معروف',
  'google_login_unknown_error_message': 'حدث خطأ غير متوقع.',
  'google_login_unexpected_error': 'حدث خطأ غير متوقع: @code',
  'Error': 'خطأ',
  'Please_create_account_first': 'يجب عليك إنشاء حساب اولا',

  // ============================================================
  // Set Password controller
  // ============================================================
  "password_reset_success": "تم إعادة تعيين كلمة المرور بنجاح",
  "password_reset_failed": "فشل في إعادة تعيين كلمة المرور",
  "otp_sent": "تم ارسال الكود بنجاح",
  "otp_verified": "تم التحقق من الكود بنجاح",

  // ============================================================
  // active jobs controller
  // ============================================================
  "fetch_jobs_failed": "فشل في جلب الوظائف",

  // ============================================================
  // EmployerController
  // ============================================================
  "warning_title": "تحذير",
  "rating_comment_required": "يرجى اختيار تقييم وكتابة تعليق.",
  "review_submitted_success": "تم إرسال التقييم بنجاح!",

  // ============================================================
  // home Controller
  // ============================================================
  "job_bookmarked_success": "تم إضافة الوظيفة للمفضلة بنجاح!",
  "job_bookmark_failed": "تعذر إضافة الوظيفة للمفضلة.",
  "job_removed_from_bookmarks": "تمت إزالة الوظيفة من المفضلة.",
  "job_remove_bookmark_failed": "تعذر إزالة الوظيفة من المفضلة.",
  "all": "الكل",

  // ============================================================
  //search job Controller
  // ============================================================
  "part_time": "دوام جزئي",
  "full_time": "دوام كامل",
  "flexible_job": "وظيفة مرنة",
  "non_flexible_job": "وظيفة غير مرنة",
  "hot_job": "وظيفة شائعة",

  // ============================================================
  //complaintController
  // ============================================================
  "complaint_empty_error": "يرجى إدخال تفاصيل الشكوى الخاصة بك.",
  "complaint_success_message": "تم تقديم الشكوى بنجاح.",

  // ============================================================
  //job details controller
  // ============================================================
  "job_application_success": "تم التقديم على الوظيفة بنجاح.",
  "job_withdraw_success": "تم سحب طلب الوظيفة بنجاح.",

  // ============================================================
  //contract controller
  // ============================================================
  "please_sign": "يرجى التوقيع قبل المتابعة.",
  "signature_generation_failed": "فشل في إنشاء صورة التوقيع.",
  "no_file_url": "لم يتم إرجاع رابط للملف من واجهة رفع الملفات.",
  "contract_signed": "تم توقيع العقد بنجاح.",

  // ============================================================
  //back national id controller
  // ============================================================
  "back_id_required": "يرجى تقديم صورة بطاقة الهوية الخلفية للمتابعة",

  // ============================================================
  //create acc controller
  // ============================================================
  "failed": "فشل",
  "male": "ذكر",
  "female": "أنثى",
  "birth_date_required": "لا يمكن أن يكون تاريخ الميلاد فارغًا",
  "gender_required": "يرجى اختيار الجنس",
  "city_required": "يرجى اختيار المدينة",
  "area_required": "يرجى اختيار المنطقة",

  // ============================================================
  //create acc cv controller
  // ============================================================
  "cv_required": "يرجى تقديم السيرة الذاتية للمتابعة",
  "upload_failed": "فشل التحميل",
  "upload_error": "فشل في تحميل الملفات.",
  "profile_updated": "تم تحديث الملف الشخصي",
  "upload_success": "تم تحميل ملفاتك ومعلوماتك بنجاح!",
  "update_failed": "فشل التحديث",
  "update_error": "فشل في تحديث ملفك الشخصي.",

  // ============================================================
  //create acc set pass controller
  // ============================================================
  "registration_completed": "تم إنشاء الحساب بنجاح.",
  "something_went_wrong": "حدث خطأ ما، الرجاء المحاولة مرة أخرى.",

  // ============================================================
  //create acc skills controller
  // ============================================================
  "select_at_least_one_skill": "يرجى اختيار مهارة واحدة على الأقل",
  "skills_fetch_failed": "فشل في جلب المهارات",

  // ============================================================
  //create acc education info controller
  // ============================================================
  "select_university": "يرجى اختيار الجامعة",
  "select_faculty": "يرجى اختيار الكلية",
  "select_graduation_year": "يرجى اختيار سنة التخرج",
  "select_status": "يرجى اختيار الحالة",
  "student": "طالب",
  "fresh_graduate": "خريج حديث",
  "graduate": "خريج",
  "education_image_required": "يرجى توفير صورة التعليم للمتابعة",

  // ============================================================
  //create acc front national id controller
  // ============================================================
  "front_id_required": "يرجى توفير صورة البطاقة الأمامية للمتابعة",
  "pic_with_id_required": "يرجى توفير صورة لنفسك أثناء حمل البطاقة للمتابعة",

  // ============================================================
  //bookmark job controller
  // ============================================================
  "job_removed_bookmark": "تم إزالة الوظيفة من المحفوظات.",
  "job_could_not_remove": "تعذر إزالة الوظيفة من المحفوظات.",

  // ============================================================
  //contact us controller
  // ============================================================
  "message_sent_successfully": "تم إرسال الرسالة بنجاح",
  "message_sent_failed": "فشل إرسال الرسالة",

  // ============================================================
  // more controller
  // ============================================================
  "account_deleted_successfully": "تم حذف حسابك بنجاح",
  "account_deleted_failed": "فشل حذف حسابك",

  // ============================================================
  // profile controller
  // ============================================================
  "photo_delete_failed": "فشل حذف الصورة",
  "photo_upload_failed": "فشل تحميل الصورة",
  "photo_update_failed": "فشل تحديث الصورة",
  "no_file_url_returned": "لم يتم إرجاع رابط للملف من واجهة التحميل",
  "bookmark_removed": "تمت إزالة الوظيفة من المفضلة",
  "could_not_remove_bookmark": "تعذر إزالة الوظيفة من المفضلة",
  // "file_upload_failed": "فشل تحميل الملف",

  // ============================================================
  // edit cv profile controller
  // ============================================================
  "nothing_to_update": "لا يوجد شيء للتحديث",
  "no_changes_made": "لم تقم بأي تغييرات على الملف الخاص بك.",
  "edit_successfully": "تم التعديل بنجاح",
  "edit_failed": "فشل التعديل",

  // ============================================================
  // edit education controller
  // ============================================================
  "select_graduation_year_msg": "الرجاء اختيار سنة التخرج",
  "select_faculty_msg": "الرجاء اختيار الكلية",

  // ============================================================
  // notification strikee screen
  // ============================================================
  "warning_label": "تحذير",
  "violation_rules": "مخالفة قواعد التطبيق",
  "warning_info_title": "لماذا لا تريد الحصول على تحذير؟",
  "warning_info_tips": "كيف تتجنب الحصول على تحذير؟",
  "violations_count": "@current من أصل @total مخالفات",
  "warning_tips_list":
      "الوصول في الوقت المحدد\nالحفاظ على السلوك المهني\nتلبية توقعات الأداء\nاتباع سياسات مكان العمل",
  "warning_consequences_list":
      "يتم تسجيله في سجل عملك\nيؤثر على فرص قبولك في وظيفة أخرى\nبعد 3 مخالفات سيتم حظر حسابك",

  // ============================================================
  // block screen
  // ============================================================
  "account_disabled": "تم تعطيل حسابك!",

  // ============================================================
  // privacy policy screen
  // ============================================================
  "privacy_policy": "سياسة الخصوصية",
  "last_updated": "آخر تحديث",

  "privacy_intro":
      "نحن ملتزمون بحماية خصوصيتك. تشرح هذه السياسة كيفية جمع معلوماتك واستخدامها وحمايتها عند استخدام التطبيق.",

  "section_1_title": "1. المعلومات التي نجمعها",
  "section_1_desc":
      "أثناء التسجيل: الاسم، رقم الهاتف، البريد الإلكتروني، والسيرة الذاتية (اختياري).\n"
      "أثناء إكمال الملف الشخصي: بطاقة الهوية الوطنية، التفاصيل التعليمية، المهارات، صورة الملف الشخصي.\n"
      "أثناء التقديم للوظائف: تفاصيل الطلب وحالاته.\n"
      "المعلومات التقنية: نوع الجهاز، إصدار التطبيق، بيانات الاستخدام.",

  "section_2_title": "2. كيفية استخدام معلوماتك",
  "section_2_desc":
      "لإنشاء حسابك والتحقق منه.\n"
      "للسماح بتصفح الوظائف والتقديم عليها بعد التحقق.\n"
      "لعرض فرص عمل مناسبة لك.\n"
      "لإرسال الإشعارات والتحديثات.\n"
      "لتحسين أداء التطبيق ومنع سوء الاستخدام.",

  "section_3_title": "3. مشاركة معلوماتك",
  "section_3_desc":
      "مشاركة بياناتك مع شركائنا الموثوقين\n"
      "مع فريق الإدارة لدينا للتحقق من الملف الشخصي.\n"
      "مع مزودي الخدمات الموثوقين للاستضافة والتحليلات.\n",

  "section_4_title": "4. حماية البيانات",
  "section_4_desc":
      "نستخدم التخزين الآمن، التشفير، والوصول المقيد لحماية معلوماتك الشخصية.",

  "section_5_title": "5. حقوقك",
  "section_5_desc":
      "يمكنك تحديث أو تصحيح معلوماتك.\n"
      "طلب حذف الحساب.\n"
      "تواصل معنا لإزالة البيانات أو لأي استفسارات على [البريد الإلكتروني للدعم].",

  "section_6_title": "6. تحديثات السياسة",
  "section_6_desc":
      "قد نقوم بتحديث هذه السياسة وسنخطرك داخل التطبيق عند حدوث أي تغييرات.",

  // ============================================================
  // check in and out  Screens
  // ============================================================
  "log_attendance": "تسجيل الحضور",
  "attendance_log": "سجل الحضور",
  "scan_qr_to_check_in": "امسح رمز الـ QR لإتمام تسجيل الدخول",
  "checked_in_at": "تم تسجيل الدخول في",
  "checked_out_at": "تم تسجيل الخروج في",
  "extra_time": "وقت إضافي",
  "check_in": "تسجيل الدخول",
  "check_out": "تسجيل الخروج",
  "full_shift_requires_hours": "يتطلب الدوام الكامل hours@ ساعات عمل",
  "attendance_history": "تاريخ الحضور",
  "check_past_shifts": "تحقق من الورديات السابقة واطلع على حضورك",
  "checked_in": "تم الدخول",
  "checked_out": "تم الخروج",
  "check_in_out_note": "ملاحظة: لقد سجّلت hours@ ساعة عمل في هذا اليوم.",
  "no_data_found": "لا توجد بيانات",
  // ============================================================
  // job interview
  // ============================================================
  "job_interview": "مقابلة وظيفية",
  "interview_mode": "وضع المقابلة",
  "date": "التاريخ",
  "job_title": "عنوان الوظيفة",
  "reject_interview": "رفض المقابلة",
  "accept_interview": "قبول المقابلة",
  "interview_rejected": "لقد رفضت هذه المقابلة.",
  "interview_accepted": "لقد قبلت هذه المقابلة.",
  // ============================================================
  // job interview controller
  // ============================================================
  "interview_status_sent_successfully": "تم ارسال حالة المقابلة بنجاح",
  "failed_to_send_interview_status": "فشل في ارسال حالة المقابلة",
  "invalid_link_title": "تعذّر فتح الرابط",
  "invalid_meeting_link": "رابط الاجتماع غير صالح أو غير متاح.",
  "online": "أونلاين",
  "onsite": "في الموقع",
  "meeting_link": "رابط المقابلة",
  "meeting_location": "رابط الموقع",
};
